@lianatech-teemu-hemmila can you try with HEAD? I just tried your first example and it works for me

```terraform
module "private-dns" {
  source     = "../modules/dns"
  project_id = module.project.id
  name       = "test-example"
  zone_config = {
    domain = "gcp.example.com."
    public = {}
  }
}
```
Result:
```
Terraform will perform the following actions:

  # module.private-dns.google_dns_managed_zone.dns_managed_zone[0] will be created
  + resource "google_dns_managed_zone" "dns_managed_zone" {
      + creation_time    = (known after apply)
      + description      = "Terraform managed."
      + dns_name         = "gcp.example.com."
      + effective_labels = (known after apply)
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "test-example"
      + name_servers     = (known after apply)
      + project          = "<REDACTED>"
      + reverse_lookup   = false
      + terraform_labels = (known after apply)
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.private-dns.google_dns_managed_zone.dns_managed_zone[0]: Creating...
module.private-dns.google_dns_managed_zone.dns_managed_zone[0]: Creation complete after 2s [id=projects/<REDACTED>/managedZones/test-example]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```